# In[]:
# -*- coding: utf-8 -*-
"""
Created on 11/16/20 4:54 PM

@author: Mohadese Rahnama

"""
import requests
import json
import pandas

def callApi(url, data, tokenKey):
    headers = {
        'Content-Type': "application/json",
        'Authorization': "Bearer " + tokenKey,
        'Cache-Control': "no-cache"
    }
    response = requests.request("POST", url, data=data.encode("utf-8"), headers=headers)
    return response.text
def GetToken():

    baseUrl = "http://api.text-mining.ir/api/"
    url = baseUrl + "Token/GetToken"
    querystring = {"apikey": "2b90911f-0f28-eb11-80ed-98ded002619b"}
    response = requests.request("GET", url, params=querystring)
    data = json.loads(response.text)
    # print(data)
    tokenKey = data['token']

    return tokenKey

    ################ Call Slang to Formal Converter ##################
def formal_converter(text):
    baseUrl = "http://api.text-mining.ir/api/"
    tokenKey = GetToken()
    url = baseUrl + "TextRefinement/FormalConverter"


    formal = callApi(url, json.dumps(text), tokenKey)
    return formal

#example
# print(formal_converter("اگر اینجا هستید احتمالا به این معنیه که در حوزه ی برنامه نویسی مبتدی هستید! و برنامه نویسی رو تازه شروع کردید یا قصد دارید شروع کنید..خیلی از برنامه نویسان با تجربه بر این باور هستند که اگر این نکاتی که در ادامه بهتون میگم رو میدونستن قطعا خیلی راحتتر و سریع تر به جایگاه امروزشون میرسیدن.8 نکته ی مهم:قطعا برای کسانی که میخواهند وارد حوزه ی برنامه نویسی بشوند این اصلا خبر خوبی نیست اما حقیقت داره! هدف شما از برنامه نویسی هرچی هم که باشه باید این رو بدانید که قرار نیست آسان باشد.درست مثل هرچیز جدیدی که میخواهید یاد بگیرید باید از صفر شروع کنید. تلاش برای صعود از نردبان پیشرفت ممکنه ماه ها و سالها طول بکشد. بنابراین به این نکته آگاه باشید که این مسیر قراره سخت و چالش برانگیز باشه. خیلی از اوقات ممکنه قصد ترک کردن این حوزه را داشته باشید اما چیزی که باعث میشود شما به تلاشتان ادامه دهید علاقه و پشتکار شماست. پس :اطمینان حاصل کنید که در ذهن خود هدفی دارید و آن را برای خود واضح و شفاف کنید. شما قراره خیلی از کارها را تنهایی انجام دهید پس مهمه که چیزی داشته باشید که به شما انگیزه بده. اگر عاشق یادگیری به تنهایی هستید ، از کتاب ها و دوره های آنلاین استفاده کنید.اگر یادگیری با دیگران را ترجیح می دهید ، یک گروه کاری در نزدیکی خود پیدا کنید و با افراد همفکر خود تمرین کنید.همین الان به این سوال جواب دهید: با برنامه نویسی میخواید به چی برسید؟جواب دادید؟‌بسیار عالی… این قراره هدف شما و منبع انگیزه توی این طول این مسیر پر چالش باشه.خیلی مهم است که برای برنامه نویسی هدفی بلند مدت داشته باشیدهدفی که ارزش این را داشته باشد که شما هر روز و روزانه چندین ساعت را پشت مانیتور مشغول حل کردن مسایل گوناگون باشید.این یک اصول نیست اما واقعا کار شما را راحتتر میکند! اگر در برنامه نویسی مبتدی هستید و همچنین از مبانی و علوم کامپیوتر سر در نمیاورید بهتر این است که مبانی کامپیوتر را یاد بگییرید و درک کنید که کامپیوتری که ازش استفاده میکنید چطور کار میکنه! این کار الزامی نیست اما بسیار به فهم شما و در نتیجه پیشرفت شما کمک میکنه!اگر شما اهداف غیر منطقی در ذهن داشته باشید نمیتوانید به مدت طولانی دوام بیاورید چرا که پیشرفت یک شبه اتفاق نمیفته. اگر شما اهدافی غیر واقع بینانه داشته باشید با اولین چالش ها و موانع سرد میشید و ممکنه از ادامه مسیر خسته شوید و کنار بشید. بزرگترین مانع شما در حوزه برنامه نویسی نا امیدی شماست. پس اهداف واقع بینانه داشته باشیدو سعی کنید به مرور زمان بهتر و بهتر بشید.اگر تصمیم دارید به یک برنامه نویس حرفه ای تبدیل شوید بهتون تبریک میگم. شما در این مسیر از مهارتهای خودتون برای ساخت پروژه های گوناگون استفاده خواهید کرد…البته در ابتدا این پروژه ها کوچک هستن اما خیلی خوبه که هرچی که الان در ابتدا دارید میسازید به این فکر کنید که در آینده میخواهید چه شغلی داشته باشید و در چه زمینه ای ادامه خواهید داد؟ میخواهید چه کار کنید؟ کجا کار کنید؟سعی کنید پروژه های معنی دار بسازید! از خودتون بپرسید آیا این پروژه ای که مشغول آن هستم مشکلی از کسی حل خواهد کرد؟ ساخت پروزه های با ارزش کارنامه ی شما را درخشان میکند بنابراین راحتتر میتوانید کارفرما را جذب کنید. در کار خود خلاق باشید و در پی حل کردن مشکلات گوناگون توسط مهارتهای خود باشیداگر بخواهیم لیستی از ویژگی های عالی برای برنامه نویسان را بگوییم شاید 100 ویژگی وجود  داشته باشد اما دو ویژگی وجود داره که بدون اینها نمیتوانید ادامه دهید:* عزم راسخ* صبرچه چیزی شما را به حرکت در میاورد؟ برای چی شروع کردید؟ موفقیت در برنامه نویسی نیاز به هوش بالا ندارد تنها چیزی که شما را موفق میکند عزم و پشتکار شماست. آتشی که اجاق شما را روشن نگه میدارد همان دلیلی است که شما به خاطر آن این مسیر را شروع کردید.این باعث می شود که شما حتی در شرایط دشوار به یادگیری ادامه دهید. و اما صبر چیزی است که مکمل عزم و اراده شما برای رسیدن به آرزوهای  بزرگ در این مسیر است. داشتن هدف های بزرگ در این حوزه اصلا اشکالی ندارد اما اگر صبر نداشته باشید تبدیل به کابوس خواهد شد. هیچ کس یک شبه برنامه نویس موفقی نشده است.به خاطر دارید که بهتون توصیه کردیم به شغل آینده ی خود فکر کنید؟ به این فکر کنید که قراره در چه زمینه ای ادامه بدید؟ خب:قطعا وقتی که شما درحال یادگیری هستید و تازه شروع به اینکار کردید چیزهایی را مشاهده خواهید کرد که ممکنه شما را از هدف اصلی خود دور کند! فرض کنید شما برنامه نویسی تحت وب بک اند را انتخاب کرده اید و در میانه راه با افرادی معاشرت خواهید کرد که مثلا برنامه نویس موبایل (اندروید) هستند! و شما تحت تاثیر این حوزه قرار میگیرید! اشکالی ندارد که حس کنجکاوی خود را ارضا کنید و بدانید که برنامه نویسی موبایل به چه شکل هست اما خود را درگیر آن نکنید این کار افتضاح است. مثلا شما مشغول یادگیری برنامه نویسی وب با زبان پی اچ پی هستید پس دلیلی نداره تمرکز خودتون را از این حوزه بردارید. البته این به این موضوع بستگی داره که آیا واقعا حوزه ای که انتخاب کردید رو دوست دارید؟ آیا به اندازه ی کافی تحقیق کردید ؟ اگر نه… شما همیشه درحال جا به جا شدن از حوزه های برنامه نویسی هستید.این مقاله به شما کمک میکنه: معرفی حوزه‌های برنامه‌نویسیمیخواهید برنامه نویس شوید؟ بسیار خب شروع کنید….چیزهای زیادی وجود داره که ممکنه شما را برای شروع در برنامه نویسی به شک بیندازد اما آیا اینها حقیقت دارند؟اینکه شما باید بسیار باهوش باشید! باید در ریاضیات قوی باشید! در دانشگاه یاد بگیرید و … هیچکدام از اینها نیاز ملزم شما برای شروع نیست. بسیار ی از یرنامه نویسان مطرح دنیا حتی به دانشگاه هم وارد نشده اند پس این فکرها را دور بریزید و همین الان با یک سرچ سریع دوره ای را پیدا کنید و هر روز تمرین کنید… نکات بالا را در ذهن داشته باشید و ادامه دهید.خواندن این مقاله ی کوتاه رو هم به شما قبل از شروع برنامه نویسی پیشنهاد میکنم: (پیش نیازهای برنامه نویسی)موفق باشید.امیدوارم خوندن این مقاله بهتون کمک کنه تا برنامه نویسی رو با لذت شروع کنید و پیش برید.مقاله اختصاصی از پونز وب |  هرگونه کپی از این مقاله با ذکر منبع آزاده :))"))
if __name__ == '__main__':
    path="/home/myubuntu/PycharmProjects/AIcampus/Spider/dataset.csv"
    data = pandas.read_csv(path)

    for i in range(len(data)):
        print("Record "+str(i)+" is processed.")
        text=data.loc[i,"body"]
        text=formal_converter(text)
        data.loc[i, "body"] =text

    data.to_csv("FormalResults.csv", index=False)


